"There was an error in processing the images." = "Beim Bearbeiten der Bilder ist ein Fehler aufgetreten.";

"The MakePDF application not found on this system." = "Das Programm „MakePDF“ wurde auf diesem System nicht gefunden.";